# Approved native packages — installed by install/setup.sh. One per line; '#' comments and blanks ignored.

git
base-devel
stow
nftables

linux-zen
linux-zen-headers
intel-ucode

sway
swaybg
swayidle
swaylock
wmenu
xorg-xwayland
grim
slurp
wl-clipboard
dex
gtk-layer-shell
qt5-wayland
qt6-wayland
xdg-desktop-portal-wlr
fuzzel

kitty
bash
zsh
bash-completion

noto-fonts
ttf-jetbrains-mono-nerd

pipewire-pulse
wireplumber
pavucontrol

firefox
discord
zed

nvidia-open-dkms
nvidia-settings
nvidia-utils
libva-nvidia-driver
libva-utils
mangohud

github-cli
xdg-utils
unzip
wget
htop
nano
yazi
fzf
bat
jq
imagemagick
neovim
fastfetch
fd
ripgrep
luarocks
tree-sitter-cli
pnpm
go
rust

nautilus
gnome-themes-extra

libreoffice-fresh
linux-firmware
ollama-cuda
python-pip
python-pipx
tree

qemu-desktop
libvirt
virt-manager
dnsmasq
edk2-ovmf
qbittorrent
