# Base & Build
base-devel
git
stow
unzip
wget

# Kernel & Firmware
linux-zen
linux-zen-headers
linux-firmware
intel-ucode

# Security & Network
nftables

# Display & Wayland
wayland
cairo
pango
cjson
sway
swaybg
swayidle
swaylock
wmenu
xorg-xwayland
xdg-desktop-portal-wlr
xdg-utils
gtk-layer-shell
qt5-wayland
qt6-wayland

# GPU
nvidia-open-dkms
nvidia-settings
nvidia-utils
libva-nvidia-driver
libva-utils

# Audio
pipewire-pulse
rtkit
wireplumber

# Fonts
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
ttf-jetbrains-mono-nerd

# Terminal & Shell
kitty
bash
bash-completion
tmux
vim

# CLI Tools
bat
fd
fzf
github-cli
htop
jq
nano
ripgrep
tree
yazi

# GUI Apps
firefox
zed
nautilus
libreoffice-fresh
qbittorrent
fastfetch

# Media & Files
grim
slurp
wl-clipboard
imagemagick
mpv

# Languages & Runtimes
go
python-pip
pnpm
rust

# Themes
gnome-themes-extra
